#ifndef _MAIN_H_
#define _MAIN_H_
//=============================================================================
//
// ライブラリ処理 [main.h]
// Author : Takahashi Naoyuki
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include <windows.h>
#include <tchar.h>
#include <d3d9.h>
#include <d3dx9.h>
#include <map>
#include <iostream>
#include <string>
#include <vector>

//=============================================================================
// ライブラリのリンク
//=============================================================================
#pragma comment(lib, "dxguid.lib")
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")

#endif