#ifndef _BARREL_FACTORY_H_
#define _BARREL_FACTORY_H_
//=============================================================================
//
// クラス [barrel_factory.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "main.h"

//=========================================================================
// クラス定義
//=========================================================================
class CBarrelFactory
{
public:
	CBarrelFactory();		// コンストラクタ
	~CBarrelFactory() {}	// デストラクタ

	static CBarrelFactory *Create();	// インスタンス生成
	void Update();						// 更新処理

	void CreateBarrel();				// 樽の生成
private:
	// private関数
	int m_nCreateCount;
};

#endif