//=============================================================================
// barrl_factoryクラス [barrel_factory.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "barrel_factory.h"
#include "manager.h"
#include "renderer.h"
#include "game.h"
#include "texture.h"
#include "resource_manager.h"
#include "xfile.h"
#include "model_info.h"
#include "player.h"
#include "library.h"
#include "barrel.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define CREATE_INTER    (120)   // 生成の間隔

//=============================================================================
// コンストラクタ
//=============================================================================
CBarrelFactory::CBarrelFactory()
{
    m_nCreateCount = 0;
}

//=============================================================================
// インスタンス生成
//=============================================================================
CBarrelFactory * CBarrelFactory::Create()
{
    // メモリ確保
    CBarrelFactory *pBarrelFactory = new CBarrelFactory;

    // !nullcheck
    if (pBarrelFactory)
    {
        // 初期化処理
        return pBarrelFactory;
    }

    return nullptr;
}

//=============================================================================
// 更新処理
//=============================================================================
void CBarrelFactory::Update()
{
    // 樽生成
    CreateBarrel();
}

//=============================================================================
// 樽の生成
//=============================================================================
void CBarrelFactory::CreateBarrel()
{
    m_nCreateCount++;

    if (m_nCreateCount >= CREATE_INTER)
    {
        m_nCreateCount = 0;
    //    CBarrel::Create(D3DXVECTOR3(-10040.0f, 1014.8f, -15282.6f), D3DXVECTOR3(0.0f, D3DXToRadian(-25.0f), 0.0f));
    }
}
