#ifndef _CAMERA_TITLE_H_
#define _CAMERA_TITLE_H_
//=============================================================================
//
// タイトルのカメラクラスヘッダー [camera_title.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "camera.h"

//=============================================================================
// カメラクラス
//=============================================================================
class CCameraTitle : public CCamera
{
public:
    CCameraTitle();         // コンストラクタ
    ~CCameraTitle();        // デストラクタ

    HRESULT Init();                 // 初期化処理
    static CCameraTitle*Create();   // クリエイト
private:
};
#endif 