#ifndef _CAMERA_GAME_H_
#define _CAMERA_GAME_H_
//=============================================================================
//
// ゲームカメラクラスヘッダー [camera_game.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "camera.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CCameraState;

//=============================================================================
// カメラクラス
//=============================================================================
class CCameraGame : public CCamera
{
public:
	CCameraGame();					// コンストラクタ
	~CCameraGame();					// デストラクタ

	HRESULT Init();					// 初期化処理
	void Update();					// 更新処理
	static CCameraGame*Create();	// クリエイト

private:
	void StateUpdate();				// 状態の更新処理

	// メンバ変数
	CCameraState* m_pCurrentState;	// 現在の状態ポインタ
	CCameraState* m_pNextState;		// 次の状態ポインタ
};
#endif 