#ifndef _CONTROL_UI_H_
#define _CONTROL_UI_H_
//=============================================================================
//
// 操作のUIクラス [control_ui.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CControlUi : public CScene2D
{
public:
    CControlUi(PRIORITY = PRIORITY_0); // コンストラクタ
    ~CControlUi();                     // デストラクタ

    static CControlUi *Create();   // インスタンス生成
    HRESULT Init();             // 初期化処理
    void Uninit();              // 初期化処理
    void Update();              // 更新処理
    void Draw();                // 描画
    void SwitchTexture(const bool& bFlag);       // テクスチャの変更
    inline void SetDraw(const bool& bFlag) { m_bDraw = bFlag; }      // 描画の設定

private:
    bool m_bDraw;
    bool m_bTex;
};

#endif