#ifndef _GAME_H_
#define _GAME_H_
//=======================================================================================
//
// ゲームクラス [game.h]
// Author : Konishi Yuuto
//
//=======================================================================================

//=======================================================================================
// インクルードファイル
//=======================================================================================
#include "mode_base.h"

//=======================================================================================
// 前方宣言
//=======================================================================================
class CPlayer;

//=======================================================================================
// ゲームクラス
//=======================================================================================
class CGame : public CModeBase
{
public:
	CGame();		// コンストラクタ
	~CGame();		// デストラクタ

	HRESULT Init(void);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理
	static float GetGravity(void) { return m_fGravity; }; //重力
private:
	// private関数
	void CreatePlayer(void);				// プレイヤーの生成関数
	void ShowInfo(void);//情報表示

	// メンバ変数
	CPlayer *m_pPlayer;						// プレイヤーのポインタ
	bool m_bGameEnd;						// ゲームのエンドフラグ
	LPD3DXFONT m_pFont;						// デバック用フォント
	static float		m_fGravity;					// 重力
};
#endif