#ifndef _GAUGEBAR_H_
#define _GAUGEBAR_H_
//=====================================================================
//
//	ゲージ処理[gauge.h]
//	Author : toshiki
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "scene2d.h"

//=====================================================================
// クラス定義
//=====================================================================
class CGaugebar : public CScene2D
{
public:
	CGaugebar();
	~CGaugebar();

	static CGaugebar * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};


#endif // !_GAUGE_H_
