#ifndef _GAUGEBAR_H_
#define _GAUGEBAR_H_
//=====================================================================
//
//    ゲージ処理[gauge.h]
//    Author : toshiki
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "scene2d.h"

//=====================================================================
// クラス定義
//=====================================================================
class CGaugebar : public CScene2D
{
public:
    CGaugebar(PRIORITY priority);
    ~CGaugebar();

    static CGaugebar * Create();
    HRESULT Init();
    void Uninit();
    void Update();
    void Draw();

private:
};


#endif // !_GAUGE_H_
