#ifndef _GROUND_H_
#define _GROUND_H_
//=============================================================================
//
// 地面クラス [ground.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "meshfield.h"

//=========================================================================
// クラス定義
//=========================================================================
class CGround : public CMeshField
{
public:
	CGround(PRIORITY = PRIORITY_UI);		// コンストラクタ
	~CGround();							// デストラクタ

	static CGround *Create(void);		// インスタンス生成
	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 初期化処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画
private:
};

#endif