#ifndef _GROUND_H_
#define _GROUND_H_
//=============================================================================
//
// 地面クラス [ground.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "meshfield.h"

//=========================================================================
// クラス定義
//=========================================================================
class CGround : public CMeshField
{
public:
    CGround(PRIORITY = PRIORITY_UI);    // コンストラクタ
    ~CGround();                         // デストラクタ

    static CGround *Create();   // インスタンス生成
    HRESULT Init();             // 初期化処理
    void Uninit();              // 初期化処理
    void Update();              // 更新処理
    void Draw();                // 描画
private:
};

#endif