#ifndef _HEEL_H_
#define _HEEL_H_
//=============================================================================
//
// 回復クラス [heel.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "main.h"

//=========================================================================
// 前方宣言
//=========================================================================
class CHeelPoint;

//=========================================================================
// クラス定義
//=========================================================================
class CHeel
{
public:
	CHeel();		// コンストラクタ
	~CHeel();		// デストラクタ

	static CHeel *Create();									// インスタンス生成
	HRESULT Init();											// 初期化処理
	void Uninit();											// 終了処理
	void Update();											// 更新処理
	D3DXVECTOR3 GetPointPos() { return m_PointPos; }		// チェックポイントの座標
	inline int GetPointNum()const { return m_nPointNum; }	// チェックポイントの値
private:
	// private関数
	void CreateHeelPoint();					// 旗の生成

	D3DXVECTOR3 m_PointPos;				// 座標の取得
	vector<CHeelPoint*> m_apHeelPoint;	// 旗のポインタ
	int m_nPointNum;					// 現在の番号
};

#endif