#ifndef _KEY_E_H_
#define _KEY_E_H_
//=====================================================================
//
//	E_KEYのUI [key_e.h]
//	Author : Konishi Yuuto
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "scene2d.h"

//=====================================================================
// クラス定義
//=====================================================================
class CKeyE : public CScene2D
{
public:
	CKeyE(PRIORITY);			// コンストラクタ
	~CKeyE();					// デストラクタ

	static CKeyE *Create();								// インスタンス生成
	HRESULT Init();										// 初期化処理
	void Draw();										// 描画処理
	inline void SetDrawFlag(const bool &bFlag) { m_isDraw = bFlag; }	// Drawの切り替え関数
private:
	bool m_isDraw;
};


#endif
