#ifndef _KRAKEN_H_
#define _KRAKEN_H_
//=============================================================================
//
//クラーケン(敵) [kraken.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "enemy.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CSkinmeshModel;

//=============================================================================
// クラス定義
//=============================================================================
class CKraken : public CEnemy
{
public:
	CKraken(PRIORITY Priority = PRIORITY_CHARACTER);	// コンストラクタ
	~CKraken();											// デストラクタ

	CKraken *Create();									// インスタンス生成
	HRESULT Init();										// 初期化処理
	void Uninit();										// 終了処理
	void Update();										// 更新処理
private:
	// private関数
	void Attack();						// 攻撃
	void CreateModel();					// モデルの生成
	CSkinmeshModel *m_pSkinmeshModel;	// スキンメッシュモデルポインタ

};
#endif