#ifndef _MARLIN_H_
#define _MARLIN_H_
//=============================================================================
//
// カジキ [marlin.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "wimp_enemy.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CMarlinModel;

//=============================================================================
// クラス定義
//=============================================================================
class CMarlin : public CWimpEnemy
{
public:
	CMarlin(PRIORITY Priority = PRIORITY_CHARACTER);	// コンストラクタ
	~CMarlin();											// デストラクタ

	static CMarlin *Create();									// インスタンス生成
	HRESULT Init();										// 初期化処理
	void Uninit();										// 終了処理
	void Update();										// 更新処理

private:
	// private関数
	void CreateModel();				// モデル生成
	void Attack();					// 攻撃

	// メンバ変数
	CMarlinModel *m_pMarlinModel;	// モデルのポインタ
};
#endif