#ifndef _NPC_SENTENCE_ENEMY1_H_
#define _NPC_SENTENCE_ENEMY1_H_
//=============================================================================
//
// NPCの文章(エネミー1) [npc_sentence_enemy1.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
//インクルード
//=============================================================================
#include "scene2D.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPolygon;

//=============================================================================
// クラス定義
//=============================================================================
class CNpcSentenceEnemy1 : public CScene2D
{
public:
    CNpcSentenceEnemy1();    // コンストラクタ
    ~CNpcSentenceEnemy1();   // デストラクタ

    static CNpcSentenceEnemy1* Create();    // インスタンス生成
    HRESULT Init();                         // 初期化処理
    void Uninit();                          // 終了処理
    void Update();                          // 更新処理
    void Draw();                            // 描画
    void CreateSentence();                  // 文章の生成

private:
    vector<CPolygon*> m_apSentence;  // 文章
};
#endif
