#ifndef _NPC_SENTENCE_ENEMY2_H_
#define _NPC_SENTENCE_ENEMY2_H_
//=============================================================================
//
// NPCの文章(エネミー2) [npc_sentence_enemy2.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
//インクルード
//=============================================================================
#include "billboard.h"

//=============================================================================
// クラス定義
//=============================================================================
class CNpcSentenceEnemy2 : public CBillboard
{
public:
    CNpcSentenceEnemy2();    // コンストラクタ
    ~CNpcSentenceEnemy2();   // デストラクタ

    static CNpcSentenceEnemy2* Create();    // インスタンス生成
    HRESULT Init();                         // 初期化処理
    void Uninit();                          // 終了処理
    void Update();                          // 更新処理

private:
};
#endif
