#ifndef _NPC_FACTORY_H_
#define _NPC_FACTORY_H_
//=======================================================================================
//
// ゲームクラス [npc_factory.h]
// Author : Konishi Yuuto
//
//=======================================================================================

//=======================================================================================
// インクルード
//=======================================================================================
#include "main.h"

//=======================================================================================
// 前方宣言
//=======================================================================================
class CNonPlayerCharacter;

//=======================================================================================
// クラス定義
//=======================================================================================
class CNpcFactory
{
public:
    enum NPC_TYPE
    {
        NPC_TYPE_NONE = -1,     // 初期化
        NPC_TYPE_ENEMY_INFO,    // エネミー情報
        NPC_TYPE_MAX            // 最大値
    };

    CNpcFactory();  // コンストラクタ
    ~CNpcFactory(); // デストラクタ

    static CNpcFactory *Create();   // インスタンス生成
    HRESULT Init();                 // 初期化処理
    void Uninit();                  // 終了処理
    void Update();                  // 更新処理

    inline CNonPlayerCharacter* GetNPC(NPC_TYPE type) { return m_pNPC.at(type); }

private:
    // private関数
    void CreateNPC();    // NPC生成

    // メンバ変数
    vector<CNonPlayerCharacter*> m_pNPC;   // NPC
};
#endif