#ifndef _PLANE_VORTEX_H_
#define _PLANE_VORTEX_H_
//=====================================================================
//
//    パーティクル処理[particlevortex.h]
//    Author : toshiki
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "plane.h"

//=====================================================================
// クラス定義
//=====================================================================
class CPlaneVortex : public CPlane
{
public:
    //==================
    // メンバ関数
    //==================
    CPlaneVortex();
    ~CPlaneVortex();

    static CPlaneVortex * Create(const D3DXVECTOR3 &pos);
    HRESULT Init();
    void Update();
    void Uninit();
    void Draw();
private:
    //==================
    // メンバ変数
    //==================
    float m_fRot;           // 回転
};

#endif
