#ifndef _PLAYER_EDITOR_H_
#define _PLAYER_EDITOR_H_
//=======================================================================================
//
// プレイヤーのエディタクラス [player_editor.h]
// Author : Konishi Yuuto
//
//=======================================================================================

//=======================================================================================
// インクルードファイル
//=======================================================================================
#include "mode_base.h"

//=======================================================================================
// 前方宣言
//=======================================================================================
class CPlayer;

//=======================================================================================
// ゲームクラス
//=======================================================================================
class CPlayerEditor : public CModeBase
{
public:
	CPlayerEditor();		// コンストラクタ
	~CPlayerEditor();		// デストラクタ

	HRESULT Init(void);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理

private:
	// private関数
	void PlayerCreate(void);				// プレイヤーの生成関数

	// メンバ変数
	CPlayer *m_pPlayer;						// プレイヤーのポインタ
	bool m_bGameEnd;						// ゲームのエンドフラグ
	LPD3DXFONT m_pFont;						// デバック用フォント
};
#endif