#ifndef _PRODUCTION_ANGRY_KRAKEN_H_
#define _PRODUCTION_ANGRY_KRAKEN_H_
//=======================================================================================
//
// クラーケンが怒る演出クラス [production_angry_kraken.h]
// Author : Konishi Yuuto
//
//=======================================================================================

//=======================================================================================
// インクルードファイル
//=======================================================================================
#include "production.h"

//=======================================================================================
// クラス定義
//=======================================================================================
class CProductionAngryKraken : public CProduction
{
public:
    CProductionAngryKraken();    // コンストラクタ
    ~CProductionAngryKraken();   // デストラクタ

    static CProductionAngryKraken* Create();    // インスタンス生成
    void Init();                                // 初期化処理
    void Uninit();                              // 終了処理
    void Update();                              // 更新処理

private:
};
#endif