#ifndef _PRODUCTION_DEAD_KRAKEN_H_
#define _PRODUCTION_DEAD_KRAKEN_H_
//=======================================================================================
//
// クラーケンが死ぬ演出クラス [production_dead_kraken.h]
// Author : Konishi Yuuto
//
//=======================================================================================

//=======================================================================================
// インクルードファイル
//=======================================================================================
#include "production.h"

//=======================================================================================
// クラス定義
//=======================================================================================
class CProductionDeadKraken : public CProduction
{
public:
    CProductionDeadKraken();    // コンストラクタ
    ~CProductionDeadKraken();   // デストラクタ

    static CProductionDeadKraken* Create(); // インスタンス生成
    void Init();                            // 初期化処理
    void Uninit();                          // 終了処理
    void Update();                          // 更新処理

private:
};
#endif