#ifndef _ROTATE_GIMMICK_H_
#define _ROTATE_GIMMICK_H_
//=============================================================================
//
// 回転床のギミッククラス [rotate_gimmick.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "main.h"

//=========================================================================
// クラス定義
//=========================================================================
class CRotateGimmick
{
public:
    CRotateGimmick() {}     // コンストラクタ
    ~CRotateGimmick() {}    // デストラクタ
    static CRotateGimmick *Create(const D3DXVECTOR3 &pos);    // インスタンス生成

private:
    void CreateGimmick(const D3DXVECTOR3 &pos);
};

#endif