#ifndef _RUBBLE1_H_
#define _RUBBLE1_H_
//=============================================================================
//
// 瓦礫クラス [rubble1.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "model.h"

//=========================================================================
// クラス定義
//=========================================================================
class CRubble1 : public CModel
{
public:
	CRubble1(PRIORITY = PRIORITY_TEST_MODEL);	// コンストラクタ
	~CRubble1();								// デストラクタ

	static CRubble1 *Create();	// インスタンス生成
	HRESULT Init();				// 初期化処理
	void Uninit(void);									// 初期化処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画

private:
};

#endif