#ifndef _STATE_CAMERA_DESCENT_H_
#define _STATE_CAMERA_DESCENT_H_
//=====================================================================
//
// 降下カメラ状態管理クラス [state_camera_descent.h]
// Author : Konishi Yuuto
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "state_camera.h"

//=====================================================================
// 前方宣言
//=====================================================================
class CCamera;

//=====================================================================
// クラス定義
//=====================================================================
class CCameraStateDescent : public CCameraState
{
public:
    CCameraStateDescent();   // コンストラクタ
    ~CCameraStateDescent();  // デストラクタ

    static CCameraStateDescent* Create();    // インスタンス生成
    void Init();                            // 初期化処理
    void Update()override;                  // 更新処理

private:
    int m_nCount;
};
#endif