#ifndef _STATE_KRAKEN_H_
#define _STATE_KRAKEN_H_
//=====================================================================
//
// クラーケン状態管理クラス [state_kraken.h]
// Author : Konishi Yuuto
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "state.h"

//=====================================================================
// 前方宣言
//=====================================================================
class CKraken;

//=====================================================================
// クラス定義
//=====================================================================
class CKrakenState : public CState
{
public:
    CKrakenState();     // コンストラクタ
    ~CKrakenState();    // デストラクタ

protected:
    virtual void SetAnimation(const UINT &animID, const FLOAT &time);   // アニメーション設定
    CKraken* GetKrakenPtr()const;
private:
};
#endif