//=====================================================================
//
// クラーケン攻撃状態クラス [state_kraken_damage.cpp]
// Author : Konishi Yuuto
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "state_kraken_damage.h"
#include "player.h"
#include "manager.h"
#include "game.h"
#include "library.h"
#include "skinmesh_model.h"
#include "animation_skinmesh.h"
#include "kraken.h"

//=====================================================================
// コンストラクタ
//=====================================================================
CKrakenStateDamage::CKrakenStateDamage()
{
}

//=====================================================================
// デストラクタ
//=====================================================================
CKrakenStateDamage::~CKrakenStateDamage()
{

}

//=====================================================================
// インスタンス生成
//=====================================================================
CKrakenStateDamage * CKrakenStateDamage::Create()
{
    // メモリ確保
    CKrakenStateDamage *pState = new CKrakenStateDamage;
    if (pState)
    {
        // 初期化処理
        pState->Init();
        return pState;
    }

    return nullptr;
}

//=====================================================================
// 初期化処理
//=====================================================================
void CKrakenStateDamage::Init()
{
    // アニメーション設定
    SetAnimation(UINT((CKraken::MOTION_MAX - 1) - CKraken::MOTION_DAMAGE), 60);
}

//=====================================================================
// 更新処理
//=====================================================================
void CKrakenStateDamage::Update()
{

}