#ifndef _STATE_CAMERA_CANNON_H_
#define _STATE_CAMERA_CANNON_H_
//=====================================================================
//
//    大砲時カメラ状態管理クラス [state_camera_cannon.h]
//    Author : Konishi Yuuto
//
//=====================================================================

//=====================================================================
// インクルードファイル
//=====================================================================
#include "state_camera.h"

//=====================================================================
// 前方宣言
//=====================================================================
class CCamera;

//=====================================================================
// クラス定義
//=====================================================================
class CCameraStateCannon : public CCameraState
{
public:
    CCameraStateCannon();                   // コンストラクタ
    ~CCameraStateCannon();                  // デストラクタ
    static CCameraStateCannon* Create();    // インスタンス生成

    void Init();            // 初期化処理
    void Update()override;  // 更新処理

private:
    void TrackingCannon(CCamera* &pCamera);    // 大砲の方へ向く
};
#endif