#ifndef _BOSS_HP_BACK_H_
#define _BOSS_HP_BACK_H_
//=============================================================================
//
// タイトルUIクラス [title_logo.h]
// Author : Suzuki Mahiro
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// クラス定義
//=========================================================================
class CTitleLogo : public CScene2D
{
public:
    CTitleLogo(PRIORITY);   // コンストラクタ
    ~CTitleLogo();          // デストラクタ

    static CTitleLogo *Create();    // インスタンス生成
    HRESULT Init();                 // 初期化処理
    void Uninit();                  // 初期化処理
    void Update();                  // 更新処理
    void Draw();                    // 描画
private:
};

#endif